package quiz;

import java.util.List;
public class InMemoryQuestionStorage implements QuestionStorage {
    private List<Question> questions;
    private int currentQuestion = 0;
    public InMemoryQuestionStorage() {
        questions =  List.of(
                new Question("На полотне изображены четыре бурых медвежонка, которые резвятся на поваленном дереве в густом сосновом бору." +
                        " Сквозь утренний туман пробиваются первые лучи солнца, освещая лесную чащу.", "Утро в сосновом лесу"),
                new Question("Огромная морская волна нависает над обломком мачты, за который из последних сил держатся несколько потерпевших" +
                        " кораблекрушение моряков. На горизонте занимается рассвет, дающий людям слабую надежду на спасение.", "Девятый вал"),
                new Question("Три могучих всадника в доспехах на конях стоят на страже русской земли, внимательно всматриваясь вдаль. За их " +
                        "спинами — холмистая степь и грозовое небо, а под ногами шумит ковыль.", "Богатыри"),
                new Question("На картине изображена молодая женщина в элегантном тёмном платье и шляпе с пером, сидящая в коляске у ресторана." +
                        " Её лицо выражает надменность и загадочность, а взгляд устремлён прямо на зрителя.", "Незнакомка"),
                new Question("Мальчик с опущенной головой стоит посреди комнаты с портфелем, а его мать и сестра с укором смотрят на него." +
                        " Радостно встречает его только верный пёс, положивший лапы на грудь провинившегося школьника.", "Опять двойка"),
                new Question("В мрачной палате царь в ужасе обнимает смертельно раненного сына, из головы которого хлещет кровь. Глаза отца" +
                        " полны раскаяния и безумия, а на полу лежит окровавленный посох.", "Иван Грозный и сын его Иван"),
                new Question("На полотне изображена молодая женщина с загадочной полуулыбкой, сидящая на фоне туманного пейзажа с извилистой" +
                        " рекой и мостом. Её взгляд направлен прямо на зрителя и словно следует за ним по комнате.", "Мона Лиза"),
                new Question("Над спящей деревней раскинулось бурлящее ночное небо, заполненное светящимися вихрями звёзд и ярким серпом луны." +
                        " На переднем плане тёмный кипарис тянется вверх, словно связывая землю и космос.", "Звёздная ночь"),
                new Question("На пустынном берегу лежат мягкие, словно плавящиеся карманные часы, которые стекают с ветки дерева и каменного" +
                        " выступа. В центре композиции — странное спящее существо с закрытыми глазами и длинными ресницами.", "Постоянство памяти"),
                new Question("Юная девушка в экзотическом тюрбане обернулась через плечо и с лёгкой полуулыбкой смотрит прямо на зрителя. " +
                        "Крупная жемчужная серёжка ярко блестит на фоне тёмного фона, притягивая взгляд.", "Девушка с жемчужной серёжкой"),
                new Question("На мосту стоит искажённая фигура с бледным, похожим на череп лицом, которая в ужасе схватилась за голову. " +
                        "За ней простирается кроваво-красное небо над тёмным фьордом, отражающее состояние отчаяния.", "Крик"),
                new Question("За длинным столом сидят тринадцать мужчин, и центральный из них только что произнёс слова, вызвавшие смятение " +
                        "среди остальных. Ученики сгруппировались по трое, жестами и взглядами выражая shock, гнев и недоумение.", "Тайная вечеря"),
                new Question("Прекрасная обнажённая богиня стоит в огромной раковине, которую волны прибивают к берегу, а служанка спешит " +
                        "укрыть её плащом. Слева две фигуры в объятиях летят на крыльях любви, осыпая её цветами.", "Рождение Венеры"),
                new Question("Огромное полотно, написанное в чёрно-белых и серых тонах, изображает хаос войны: разрушенные здания, кричащие " +
                        "женщины, раненые животные и разорванные тела. В центре — лошадь с искажённой мордой и лампа, освещающая ужас происходящего.", "Герника"),
                new Question("Группа вооружённых ополченцев выходит из тёмного помещения на залитую светом площадь, и их капитан в чёрном одеянии " +
                        "указывает путь. Яркий луч света выхватывает из тьмы девушку в жёлтом платье с курицей на поясе и капитана в красном мундире.", "Ночной дозор")
        );
    }
    // int size = ;
    @Override
    public Question getQuestion() {
        Question question = questions.get(currentQuestion);
        currentQuestion++;
        if (currentQuestion >= questions.size()) {
            currentQuestion = 0;
        }
        return question;
    }
}